---
kind: type
id: T:Autodesk.Revit.DB.DefinitionGroup
source: html/f3556557-3140-3296-6321-475b952f9022.htm
---
# Autodesk.Revit.DB.DefinitionGroup

The DefinitionGroup is a container that is used to hold shared parameter definitions on disk.

## Syntax (C#)
```csharp
public class DefinitionGroup : APIObject
```

## Remarks
Groups are used for logical arrangement of the shared parameters into meaningful sets.
Through the DefinitionGroup object new shared parameter definitions can be made.